# Comment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SynchronizeWithCentralOptions..::..Comment Property
SynchronizeWithCentralOptions Class See Also
---
User description of changes made since the last Sync with Central. Empty by default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string Comment { get; set; }
```

Visual Basic
---
```text
Public Property Comment As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Comment {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: comment has more than 30,000 characters. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace